# synth.ys

# Ativa o suporte a SystemVerilog
read_verilog -sv half_adder.sv

# Executa a síntese utilizando o pass básico
synth -top half_adder

# Otimiza o circuito mapeado
opt

show -width -signed -format png -prefix half_adder

# Exibe as estatísticas do circuito sintetizado
stat