# synth.ys

# Ativa o suporte a SystemVerilog
read_verilog -sv display7.sv

# Executa a síntese utilizando o pass básico
synth -top display7

# Otimiza o circuito mapeado
opt

show -width -signed -format png -prefix display7

# Exibe as estatísticas do circuito sintetizado
stat